[{"title":"Love","date":"2017-05-07T14:10:26.000Z","path":"2017/05/07/love/love/","text":"这就是爱在住的地方蜗居不久，以为跳槽到现在的公司会轻松很多，没想到以来就是遇上大版本改造中间件。身体有点吃不消。也许久没有回家了。每周末都定期和父母通话，尤其母亲很是想念。所以今天父母今天也是开车来到住所看望我，前一晚告诉父母没啥带的，不用麻烦了。但还是带了一大包零食和席子,真的很谢谢他们对我的爱","tags":[{"name":"2017随笔","slug":"2017随笔","permalink":"http://yoursite.com/tags/2017随笔/"}]},{"title":"为了所爱的运动","date":"2017-03-06T13:31:53.000Z","path":"2017/03/06/forsoccer/forsoccer/","text":"为了所爱的体育&emsp;&emsp;刚刚看完了每周一必看的节目《天下足球》😁&emsp;&emsp;好吧，其实我只是个伪足球迷，我对足球的热爱完完全全来自那荒度时光（美好时光）的PES8，实况足球国际版。我滴孩，这游戏在零几年还能再火点吗。电脑上，PlayStation上，Xbox上。我都忘了当时有没有Xbox可以玩。反正只要是各个平台上有上线的，实况足球，FIFA，我都要玩个遍。 &emsp;&emsp;记得那时几个哥哥都没成家，过年就是我们的狂欢，那必然少不了去网吧，去游戏厅。我的大哥是最喜欢足球的，所以足球游戏他是不会错过的。每次我们都会玩个很久的PES实况足球。他喜欢AC米兰和皇马，我就是曼联和巴塞罗那。如果是国家队，那他一定是意大利，我就一定是英格兰。反正每次都是我赢😎所以无所谓什么队。 &emsp;&emsp;所以说对足球的喜爱，或者说是对足球的认识，完全是从游戏开始的。但渐渐也喜欢上了足球，不愧是世界第一运动。还记得第一次看足球赛是中国队进入世界杯决赛圈，我的天哪，那时候住在爷爷家。爷爷家客厅的大沙发，放下来就是个床，中国队的比赛基本上夜夜都要熬夜看，家里也不乏和我一样有好几个伪球迷，但是当时的中国队真的可以说是梦之队。像郝海东，李铁这样的球员，现在的中国队真的是差了一大截，但是总的来说，中国队在积极组建和成长中，这是好事。虽然我最喜欢的运动是篮球，而且基本上到现在都保持着每周一次的频率去践行自己喜欢的运动。但是足球真的可以说是我所爱的运动。场上胜利11人的队伍，为了同一个目标在绿荫上奔跑真的可以说是个伟大的运动。💪🏿比起篮球的观赏性，足球更多的是代表了一种精神。这也是我最喜欢的。 &emsp;&emsp;所以说你不看足球，你不知道有些人定义了足球中的一些动作。你不知道罗纳尔多的钟摆过人，你不知道齐达内的马赛回旋，你不知道小罗的牛尾巴，你不知道禁区旁有个皮耶罗区域，你不知道巴蒂式进球，你不知道班克斯式扑救，你不知道克鲁伊夫转身，你不知道勺子点球，你不知道蝎子摆尾，你不知道彩虹过人和蛙跳过人，你不知道贝式弧线，你也不知道有炸丸子和内切射门。","tags":[{"name":"我热爱的","slug":"我热爱的","permalink":"http://yoursite.com/tags/我热爱的/"}]},{"title":"新公司","date":"2017-02-24T14:15:52.000Z","path":"2017/02/24/newstart/newstart/","text":"新公司 新开始离开 &emsp;&emsp;离开了上家公司，自己也是在Research&amp;Develop这个岗位上摸爬滚打了快一年了，从以前搞黑盒到现在的研发，总觉得自己做了不得了的决定。记得在YOHO！的时候，特别希望经理教我白盒和自动化，经理来句，你TM年纪轻轻的，学什么测试，搞开发啊。我一想 是啊，搞什么测试，去学开发去。 &emsp;&emsp;然后跟着我那程序设计老师，去做了个项目，类似今日头条App的后端和后台管理系统，那些日子真是难熬啊。天天买各种书看，几乎每天都要通宵，自己身体也受不住了，还好做完了，也上线了，自己也充实了一把，所以也把这个难熬的事情想成愉悦的经历了。起码我从一个Java初学，学习了数据库，学习了Web相关的知识Servlet‘html’css这些基本，再到传说中的几大框架实现个基本功能。也算是有点入门了，当时自己一个人做出这个后端，还是挺有成就感的，虽然现在看到老的代码觉得逻辑很奇怪，但这些都不是事😅 &emsp;&emsp;后来又来到一个不大不小的外包单位，发现还是自己一个人来负责后端，轻车熟路一般又学习到了Mybatis持久框架，也是自己一个人默默在问，在学习。更宝贵的经验是，我学习到了很多关于整个项目流程的知识，因为后端是我一人负责，开发‘部署’测试的调度也就落到我头上了。虽然当时没接触过，但我还是对经理来了一句么问题。然后自己又从网上下了很多Linux的电子书和Junit的电子书，学会了在Linux环境下自己发布部署，自己去单元测试代码。项目中也用到了很多第三方集成，像极光推送‘即时IM这样的，学习了一些第三方集成的基本知识。学习JSTL‘Bootstrap’Jquery去做更方便的后台管理系统。知道了用Ajax调用接口是多么的方便。也自己去实现了一个短信验证码的功能，从平台调取发送短信，然后保存到数据库中，传Token到App端去双向验证会更安全。这段时间自己负责了很多东西，也学到了很多东西，身边有一群贵人和好同事的帮忙，自己也很开心。 &emsp;&emsp;再后来就来到了上家公司，也接近毕业了🎓，所以说还是很想努力去💪做出一些事情的。来到这里才发现你不仅要明白技术很重要，在一个项目中，去了解业务矩阵也是非常重要的事情，你应该明白参与项目的具体全部业务，也应该明白这个项目或者说这个系统在整个公司中是承担什么职责，是原子的还是复合的，需不需要与外部系统做交互，应该用什么方式去交互，你的每一个功能实现，是不是和大家讨论过实现的方式，以及功能的实现是不是可以有分支或者策略模式去拓展的。你都要考虑。这是非常重要的，也是我在这个公司学到的最宝贵经验。还记得16年元旦给自己定了一个计划。 &emsp;&emsp;当时觉得这计划得流产，毕竟觉得有些多了。没想到就在16年底，除了第一个还都基本完成了。😎公司在新的项目中就是使用了SpringJDBCTemplet+Spring+SpringMVC去实现的，SpringJDBCTemplet以下简称JT，而且是我自己封装了数据访问层，用反射和代理把JT去封装实现了。每次操作都使用这个Jar包去实现数据访问。domin也都封装到Jar中去，让domin更纯洁。也省去了JT很多必须要实现的东西，比如Rower这些东西。自己也成就感很大，毕竟公司都用上了自己封装的东西。 来到&emsp;&emsp;年后，因为各种原因，来到了一家国企上班。怎么说呢，新到一家国企上班。最大的感悟就是，好TM严肃啊。不能上外网，不能用U盘，这让习惯懒散的我不能适应。然后这也是刚来几天的不习惯，发现也是很多的，国企的技术并不是多么落后迂腐，反而和我想的不一样，是非常先进的。有调度中心，有自己开发的中间件（目前在这个部门下），也有很多RPC的应用，有一大推自己封装的相当不错的框架，连构建都用Jenkins，觉得逼格可以啊。 所以说新公司！努力吧少年！","tags":[{"name":"2017随笔","slug":"2017随笔","permalink":"http://yoursite.com/tags/2017随笔/"}]},{"title":"First Page","date":"2017-01-08T17:21:15.000Z","path":"2017/01/09/FirstPage/","text":"欢迎来到Hexo的世界，Fanta","tags":[]}]