[{"title":"新公司","date":"2017-02-24T14:15:52.000Z","path":"2017/02/24/newstart/newstart/","text":"新公司 新开始离开&emsp;&emsp;离开了上家公司，自己也是在Research&amp;Develop这个岗位上摸爬滚打了快一年了，从以前搞黑盒到现在的研发，总觉得自己做了不得了的决定。记得在YOHO！的时候，特别希望经理教我白盒和自动化，经理来句，你TM年纪轻轻的，学什么测试，搞开发啊。我一想 是啊，搞什么测试，去学开发去。然后跟着我那程序设计老师，去做了个项目，类似今日头条App的后端和后台管理系统，那些日子真是难熬啊。天天买各种书看，几乎每天都要通宵，自己身体也受不住了，还好做完了，也上线了，自己也充实了一把，所以也把这个难熬的事情想成愉悦的经历了。起码我从一个Java初学，学习了数据库，学习了Web相关的知识Servlet‘html’css这些基本，再到传说中的几大框架实现个基本功能。也算是有点入门了，当时自己一个人做出这个后端，还是挺有成就感的，虽然现在看到老的代码觉得逻辑很奇怪，但这些都不是事😅后来又来到一个不大不小的外包单位，发现还是自己一个人来负责后端，轻车熟路一般又学习到了Mybatis持久框架，也是自己一个人默默在问，在学习。更宝贵的经验是，我学习到了很多关于整个项目流程的知识，因为后端是我一人负责，开发‘部署’测试的调度也就落到我头上了。虽然当时没接触过，但我还是对经理来了一句么问题。然后自己又从网上下了很多Linux的电子书和Junit的电子书，学会了在Linux环境下自己发布部署，自己去单元测试代码。项目中也用到了很多第三方集成，像极光推送‘即时IM这样的，学习了一些第三方集成的基本知识。学习JSTL‘Bootstrap’Jquery去做更方便的后台管理系统。知道了用Ajax调用接口是多么的方便。也自己去实现了一个短信验证码的功能，从平台调取发送短信，然后保存到数据库中，传Token到App端去双向验证会更安全。这段时间自己负责了很多东西，也学到了很多东西，身边有一群贵人和好同事的帮忙，自己也很开心。再后来就来到了上家公司，也接近毕业了🎓，所以说还是很想努力去💪做出一些事情的。来到这里才发现你不仅要明白技术很重要，在一个项目中，去了解业务矩阵也是非常重要的事情，你应该明白参与项目的具体全部业务，也应该明白这个项目或者说这个系统在整个公司中是承担什么职责，是原子的还是复合的，需不需要与外部系统做交互，应该用什么方式去交互，你的每一个功能实现，是不是和大家讨论过实现的方式，以及功能的实现是不是可以有分支或者策略模式去拓展的。你都要考虑。这是非常重要的，也是我在这个公司学到的最宝贵经验。还记得16年元旦给自己定了一个计划。 当时觉得这计划得流产，毕竟觉得有些多了。没想到就在16年底，除了第一个还都基本完成了。😎公司在新的项目中就是使用了SpringJDBCTemplet+Spring+SpringMVC去实现的，SpringJDBCTemplet以下简称JT，而且是我自己封装了数据访问层，用反射和代理把JT去封装实现了。每次操作都使用这个Jar包去实现数据访问。domin也都封装到Jar中去，让domin更纯洁。也省去了JT很多必须要实现的东西，比如Rower这些东西。自己也成就感很大，毕竟公司都用上了自己封装的东西。来到&emsp;&emsp;年后，因为各种原因，来到了一家国企上班。怎么说呢，新到一家国企上班。最大的感悟就是，好TM严肃啊。不能上外网，不能用U盘，这让习惯懒散的我不能适应。然后这也是刚来几天的不习惯，发现也是很多的，国企的技术并不是多么落后迂腐，反而和我想的不一样，是非常先进的。有调度中心，有自己开发的中间件（目前在这个部门下），也有很多RPC的应用，有一大推自己封装的相当不错的框架，连构建都用Jenkins，觉得逼格可以啊。 所以说新公司！努力吧少年！","tags":[{"name":"2017","slug":"2017","permalink":"http://yoursite.com/tags/2017/"}]},{"title":"First Page","date":"2017-01-08T17:21:15.000Z","path":"2017/01/09/FirstPage/","text":"欢迎来到Hexo的世界，Fanta","tags":[]},{"title":"Hello World","date":"2017-01-08T16:27:19.000Z","path":"2017/01/09/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick Start Create a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]